import '../model/item.dart';

List<String> quran = [
  " رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
  "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَتَوَفَّنَا مُسْلِمِين",
  "ربَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَإِسْرَافَنَا فِي أَمْرِنَا وَثَبِّتْ أَقْدَامَنَا وانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
  "رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ",
  " رَبِّ اجْعَلْنِي مُقِيمَ الصَّلاَةِ وَمِن ذُرِّيَّتِي رَبَّنَا وَتَقَبَّلْ دُعَاء، رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَاب.ُ",
  "رَبَّنَا آتِنَا مِن لَّدُنكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا",
  "رَبَّنَا آمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنتَ خَيْرُ الرَّاحِمِينَ",
  "رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْإِيمَانِ وَلَا تَجْعَلْ فِي قُلُوبِنَا غِلًّا لِّلَّذِينَ آمَنُوا رَبَّنَا إِنَّكَ رَؤُوفٌ رَّحِيمٌ.",
  "رَّبَّنَا عَلَيْكَ تَوَكَّلْنَا وَإِلَيْكَ أَنَبْنَا وَإِلَيْكَ الْمَصِيرُ",
  "رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلَّذِينَ كَفَرُوا وَاغْفِرْ لَنَا رَبَّنَا إِنَّكَ أَنتَ الْعَزِيزُ الْحَكِيمُ",
];

List<String> sonaa = [
  "اللهم إني أعوذ بك أن أرد إلى أرذل العمر",
  "اللهم اهدني لأحسن الأعمال والأخلاق لا يهدي لأحسنها إلا أنت، واصرف عني سيئها لا يصرف عني سيئها إلا أنت",
  "اللهم أصلح لي ديني, ووسّع لي في داري، وبارك لي في رزقي",
  " اللهم إني أعوذ بك من القسوة والغفلة والذلة والمسكنة، وأعوذ بك من الكفر والفسوق والشقاق والسمعة والرياء، وأعوذ بك من الصمم والبكم والجذام وسيئ الأسقام",
  "اللهم آتِ نفسي تقواها, وزكّها أنت خير من زكاها, أنت وليها ومولاها",
  "اللهم إني أعوذ بك من علم لا ينفع, وقلب لا يخشع, ونفس لا تشبع, ودعوة لا يستجاب لها.",
  "اللهم إني أعوذ بك من شر ما عملت, ومن شر ما لم أعمل, وأعوذ بك من شر ما علمت, ومن شر ما لم أعلم. ",
  "اللهم إني أعوذ بك من زوال نعمتك, وتحول عافيتك, وفجاءة نقمتك, وجميع سخطك.",
  "اللهم إني أعوذ بك من الهدم والتردي ومن الغرق والحرق والهرم, وأعوذ بك من أن يتخبطني الشيطان عند الموت, وأعوذ بك من أن أموت لديغًا, وأعوذ بك من طمع يهدي إلى طبع.",
  "اللهم إني أعوذ بك من منكرات الأخلاق والأعمال والأهواء والأدواء, وأعوذ بك من غلبة الدين وقهر العدو وشماتة الأعداء",
  " اللهم إني أسألك حبك, وحب من يحبك, وحب كل عمل يقربني إلى حبك.",
  "اللهم إني أعوذ بك من جهد البلاء, ودرك الشقاء, وسوء القضاء, وشماتة الأعداء, اللهم مقلِّب القلوب, ثبت قلبي على دينك.",
  "اللهم إني أسألك موجبات رحمتك, وعزائم مغفرتك, والغنيمة من كل بر, والسلامة من كل شر, والفوز بالجنة, والنجاة من النار.",
  "اللهم إني أسألك الفوز يوم القضاء, وعيش السعداء, ومنزل الشهداء, ومرافقة الأنبياء، والنصر على الأعداء."
];

List<Item> mnaskList = [
  Item(
      title: 'الميقات ',
      description:
          "تَجرّد من الثياب، واغتسل -إن تيسر لك- وتطيب بأطيب ما تجده من دهن عود أو غيره في رأسك ولحيتك، ولا يضر بقاء ذلك بعد الإحرام، ولكن لا تطيِّب ثياب الإحرام. ثم تبدأ بـ التلبية: 'لبيك اللهم لبيك، لبيك لا شريك لك لبيك. إن الحمد والنعمة لك والملك، لا شريك لك'. يجهر الرجل بهذه التلبية، وأما المرأة فتقولها سرًّا."),
  Item(
      title: 'الطواف ',
      description:
          ' توجه إلى المسجد الحرام لـ الطواف و عند رؤيتك للبيت كبِّر وقل: "اللهم زد هذا البيت تشريفًا وتعظيمًا وتكريمًا ومهابة وأمنًا، وزد من شرفه وكرمه ممن حجه أو اعتمره تشريفًا وتكريمًا وتعظيمًا وبِرًّا".ثم صلِّ ركعتين خلف المقام قريبًا منه -إن تيسر لك- أو بعيدًا في أي مكان من المسجد. ثم اذهب إلى زمزم واشرب منها، واحمد الله.'),
  Item(
      title: 'السعي بين الصفا و المروة',
      description:
          'اخرج إلى الصفا للسعي اصعد عليه  حتى ترى الكعبة واستقبلها وارفع يديك وهلل وكبر ثلاثًا، وقل: "لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير. لا إله إلا الله وحده أنجز وعده، ونصر عبده، وهزم الأحزاب وحده" ثلاث مرات. وتدعو أثناء السعي بما تحب، وليس لكل شوط دعاء مخصوص. إذا وصلت المروة فافعل كما فعلت على الصفا. كرر السعي سبعة أشواط. (يحسب الذهاب شوطًا والرجوع شوطًا آخر)'),
  Item(
      title: ' الحلق أو التقصير',
      description:
          'إذا أكملت السعي، احلق شعرك أو قصره والحلق أفضل (أما إذا كان قدومك مكة قريبًا من وقت الحج فالتقصير أفضل لتحلق بقية شعرك في الحج). (أما المرأة فتقصر من كل ضفيرة قدر أنملة).'),
  Item(
      title: ' المبيت بمنى ',
      description:
          'وهو من وقت غروب الشمس يوم الثامن من ذي الحجة إلى قرب طلوع فجر يوم عرفة يستحب لك الغسل والطيب ولبس إزار ورداء أبيضين نظيفين، ثم انوِ الحج وقُلْ: (لبيك حجًّا)، ثم "لبيك اللهم لبيك، لبيك لا شريك لك لبيك، إن الحمد والنعمة لك والملك، لا شريك لك".'),
  Item(
      title: 'الصلاة بمنى',
      description:
          'توجه إلى منى وصلِّ فيها الظهر والعصر والمغرب والعشاء، تجعل الرباعية ركعتين والصلاة في وقتها من غير جمع. ثم صلِّ فيها صلاة فجر اليوم التاسع.3- إذا طلعت الشمس فسِرْ إلى عرفة.'),
  Item(
      title: 'الوقوف بعرفة',
      description:
          'هو أهم أركان الحج، وقد قال رسول الله صلى الله عليه وسلم: "الحج عرفة"توجه إلى عرفة بعد شروق الشمس وصل فيها الظهر والعصر (جمع تقديم) على ركعتين ركعتين بأذان وإقامتين، وامكث فيها إلى غروب الشمس، وأكثر من الذكر والدعاء هناك، والسُّنَّة أن تستقبل القبلة عند الدعاء لا استقبال الجبل، ويستحب هذا الدعاء "لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير".'),
  Item(
      title: 'الإفاضة إلى مزدلفة',
      description:
          'إذا غربت الشمس، اذهب إلى مزدلفة فإذا وصلتها صلِّ المغرب والعشاء (جمعًا وقصرًا بأذان واحد وإقامتين) قبل أن تحط رحلك، وقبل جمع الحصى. بِتْ في مزدلفة وصلِّ الفجر في أول وقته وأكثر من الدعاء والذكر حتى الإسفار (المبيت واجب حتى طلوع الفجر والأفضل حتى الإسفار)، ويجوز للضعفاء من الرجال والنساء أن يدفعوا في آخر الليل بعد غياب القمر لتجنب الزحام. التقط سبع حصيات لرمي جمرة العقبة الأولى، ومن أي مكان أخذتها جاز.د- اذهب إلى منى قبل طلوع الشمس.'),
  Item(
      title: 'رمي الجمرات في منى ',
      description:
          'توجه إلى منى لرمي جمرة العقبة والنحر أو إلى مكة لطواف الإفاضة، وأما الحلق فيجوز في أي مكان.رمي جمرة العقبة: ارم جمرة العقبة (وهي أقرب الجمرات إلى مكة) بسبع حصيات متعاقبات واحدة بعد الأخرى، وكبِّر مع كل حصاة.'),
  Item(
      title: 'ذبح الهدي',
      description:
          'اذبح الهدي وكُلْ منه ووزع على الفقراء. الهدي واجب على المتمتع والقارن، ومستحب للمفرد.'),
  Item(
      title: 'الحلق أو التقصير',
      description:
          'احلق شعرك أو قصره، والحلق أفضل. (أما المرأة فتقصر من كل ضفيرة قدر أنملة).- إذا رميت وحلقت، فقد حللت التحلل الأول وكذلك لو فعلت اثنين من أربعة: الرمي أو الحلق أو الطواف أو السعي. أما النحر فلا يدخل هنا؛ لأنه لا يجب على جميع الحجاج.'),
  Item(
      title: 'طواف الإفاضة',
      description:
          'انزل إلى مكة وطف طواف الإفاضة (طواف الحج). وإن حللت قبل ذلك، فطف بثيابك.7- تسعى للحج -إن كنت متمتعًا، أو مفردًا أو قارنًا ولم تسع قبل ذلك مع طواف القدوم.'),
  Item(
      title: 'المبيت بمنى أيام التشريق',
      description:
          ' والمقصود بالمبيت أن يدركك الليل -ولو لحظة منه- وأنت بمنى، حتى لو كنت يقظان أو ماشيًا ولا يلزمك النوم.'),
  Item(
      title: 'رمي الجمرات',
      description:
          'من بعد الزوال تبدأ بالصغرى وهي أبعدهن عن مكة ثم الوسطى ثم جمرة العقبة، كل واحدة بسبع حصيات متعاقبات تكبر مع كل حصاة، وتقف بعد الأولى والوسطى تدعو الله مستقبلًا القبلة وتطيل الدعاء وترفع يديك، ولا تقف بعد الكبرى (العقبة).'),
  Item(
      title: 'طواف الوداع',
      description:
          'هو آخر أعمال المناسك إذا أردت الرجوع إلى بلدك، فطف عند سفرك طواف الوداع سبعة أشواط بثيابك. ويلزمك الخروج من مكة بعد ذلك، وإلا عليك إعادة الطواف. (الحائض والنفساء لا وداع عليهما).'),
];

List<Item> arkanElhaj = [
  Item(
      title: 'الإحرام (النية) ',
      description:
          'وهو نيّة الدخول في النسك لقول الرسول صلى الله عليه وسلَّم: إنما الأعمال بالنيات وإنما لكل أمرئ ما نوى. للإحرام زمان محدد وهي أشهر الحج التي ورد ذكرها في قوله تعالى: "الحج أشهر معلومات فمن فرض فيهن الحج فلا رفث ولا فسوق ولا جدال في الحج". ومكان محدد وهي المواقيت التي يُحْرِمُ الحاج منها.'),
  Item(
      title: ' الوقوف بعرفة',
      description:
          ' لقول النبي صلى الله عليه وسلم: "الحج عرفة، من جاء ليلة جَمْع قبل طلوع الفجر فقد أدرك" رواه أبوداود وغيره، والمقصود بجَمْع المزدلفة، ويبتدئ وقته من زوال شمس يوم التاسع من ذي الحجة ويمتد إلى طلوع فجر يوم النحر، وقيل يبتدأ من طلوع فجر اليوم التاسع.'),
  Item(
      title: 'الطواف(طواف الإفاضة)',
      description:
          'لقوله سبحانه: "ثم ليقضوا تفثهم وليوفوا نذورهم وليطوفوا بالبيت العتيق" وقته بعد الوقوف بعرفة ومزدلفة ولا آخر لوقته عند الجمهور بل يبقى عليه ما دام حياً،'),
  Item(
      title: 'السعي بين الصفا والمروة ',
      description:
          'لقوله صلى الله عليه وسلم: "اسعوا فإن الله كتب عليكم السعي" وهذا السعي هو سعي الحج، ووقته بالنسبة للمتمتع بعد الوقوف بعرفة ومزدلفة وطواف الإفاضة، وأما القارن والمفرد فلهما السعي بعد طواف القدوم.'),
];

List<Item> dutiesElhaj = [
  Item(
      title: 'الإحرام من الميقات',
      description:
          'لقوله صلى الله عليه وسلم حين وقت المواقيت: "هن لهن ولمن أتى عليهن من غير أهلهن لمن كان يريد الحج والعمرة"، رواه البخاري.'),
  Item(
      title: 'الوقوف بعرفة إلى الليل',
      description:
          ' لأن النبي صلى الله عليه وسلم وقف إلى الغروب، وقال: "لتأخذوا عني مناسككم".'),
  Item(
      title: 'المبيت بمزدلفة ',
      description:
          'وهذا واجب عند أكثر أهل العلم، لأنه صلى الله عليه وسلم بات بها وقال: "لتأخذ أمتي نسكها فإني لا أدري لعلي لا ألقاهم بعد عامي هذا" ولأنه صلى الله عليه وسلم أذن للضعفة بعد منتصف الليل فدل ذلك على وجوب المبيت بمزدلفة، وقد أمر الله بذكره عند المشعر الحرام.'),
  Item(
      title: 'المبيت في منى ليالي أيام التشريق',
      description:
          'لأنه صلى الله عليه وسلم بات بها وقال: "لتأخذوا عني مناسككم"، ولأنه أذن لعمه العباس أن يبيت بمكة ليالي منى من أجل سقايته، ورخص أيضاً لرعاة الإبل في ترك المبيت مما دل على وجوب المبيت لغير عذر'),
  Item(
      title: 'رمي الجمار',
      description:
          'وهي جمرة العقبة يوم العيد، والجمرات الثلاث أيام التشريق، لأن هذا هو فعل النبي صلى الله عليه وسلم، ولأن الله تعالى قال: "واذكروا الله في أيام معدودات فمن تعجل في يومين فلا إثم عليه ومن تأخر فلا إثم عليه لمن اتقى".'),
  Item(
      title: 'الحلق أو التقصير',
      description:
          'لأن النبي صلى الله عليه وسلم أمر به فقال: "وليُقَصِّر ولَيْحِلل" متفق عليه، ودعا للمحلقين ثلاثا وللمقصرين مرة.'),
  Item(
      title: 'طواف الوداع',
      description:
          'لأمره صلى الله عليه وسلم بذلك في قوله: "لا ينفرن أحد حتى يكون آخر عهده بالبيت" رواه مسلم، وقول ابن عباس: "أمر الناس أن يكون آخر عهدهم بالبيت إلا أنه خفف عن المرأة الحائض".'),
];

List<Item> taboos = [
  Item(
      title: 'لبس المخيط للرجل',
      description:
          'المخيط هو المفصَّل على قدر البدن أو العضو، بحيث يحيط به، ويستمسك عليه بنفسه، سواء كان بخياطة أو غيرها، مثل: القميص، والسراويل، ونحو ذلك.'),
  Item(
      title: 'تغطية الرأس للرجل',
      description:
          'وتكون بأن يستر رأسه بشي ملاصق لما يلبسه عادة على الرأس، مثل الشماغ والعمامة والطاقية والخوذة فهذا حرام باتفاق المذاهب الأربعة، استنادًا لحديث ابن عباس -رضي الله عنهما- عن النبي -صلى الله عليه وسلم- أنه قال في قصة الرجل الذي وقصته دابته؛ أي رمت به فكسرت عنقه: (لا تخمِّروا رأسه).'),
  Item(
      title: 'التطيب',
      description:
          'نقل عدد من العلماء إجماعَ المذاهب الأربعة على حرمة التطيب للمُحرم، منهم الإمام ابن قدامة في الشرح الكبير، واستندوا في إجماعهم على أدلة منها عن ابن عمر -رضي الله عنهما- عن النبي -صلى الله عليه وسلم- أنه قال فيما يجتنبه المحرم: (ولا يلبس ثوباً مسه زعفران ولا وَرْس).'),
  Item(
      title: 'تقليم الاظفار',
      description:
          'المحرم للعمرة أو الحج يمنع من إزالة شيء من أظافره، وذلك بإجماع المذاهب الفقهية الأربعة كما نقل الإمام ابن المنذر في كتاب الإجماع،[٩] وذلك لقوله تعالى: (ثُمَّ لْيَقْضُوا تَفَثَهُمْ وَلْيُوفُوا نُذُورَهُمْ وَلْيَطَّوَّفُوا بِالْبَيْتِ الْعَتِيقِ)،[١٤] جاء عن بعض السلف في تفسيرها أنها تدل على منع المحرم من أخذ أظفاره.'),
  Item(
      title: 'الصيد ',
      description:
          'أجمعت المذاهب الفقهية الأربعة على حرمة الصيد للمحرم،[٩] وذلك لقوله تعالى: (يَا أَيُّهَا الَّذِينَ آمَنُواْ لاَ تَقْتُلُواْ الصَّيْدَ وَأَنتُمْ حُرُمٌ وَمَن قَتَلَهُ مِنكُم مُّتَعَمِّدًا فَجَزَاء مِّثْلُ مَا قَتَلَ مِنَ النَّعَمِ يَحْكُمُ بِهِ ذَوَا عَدْلٍ مِّنكُمْ هَدْيًا بَالِغَ الْكَعْبَةِ أَوْ كَفَّارَةٌ طَعَامُ مَسَاكِينَ أَو عَدْلُ ذَلِكَ صِيَامًا لِّيَذُوقَ وَبَالَ أَمْرِهِ عَفَا اللَّهُ عَمَّا سَلَف وَمَنْ عَادَ فَيَنتَقِمُ اللَّهُ مِنْهُ وَاللَّهُ عَزِيزٌ ذُو انتِقَامٍ).'),
  Item(
      title: 'النقاب للمرأة ',
      description:
          'منعه جمهور الفقهاء من أهل العلم، وأجازه الحنفية كما ورد أنَّه جائز في رواية عند الشافعية والمالكية،﻿[1] ودليل ذلك قوله صلى الله عليه وسلم: (ولَا تَنْتَقِبِ المَرْأَةُ المُحْرِمَةُ).'),
  Item(
      title: 'لبس القفازين للمرأة',
      description:
          'يحرم على المرأة المُحرِمة لبس القفازين،[٤] وهو قول عند المالكية والحنابلة والمعتمد من المذهب الشافعي، وأجاز الحنفية لبس القفازين، واستدل الجمهور بحديث: (وَلاَ تَنْتَقِبُ الْمَرْأَةُ الْمُحْرِمَةُ، وَلاَ تَلْبَسُ الْقُفَّازَيْنِ).'),
];

List<Item> fatawi = [
  Item(
      title:
          'إذا خاف المحرم ألا يتمكن من أداء نسكه بسبب مرض أو خوف، فماذا يفعل؟',
      description:
          'إذا أحرم يقول عند إحرامه: "فإن حبسني حابس فمحلي حيث حبستني". فإذا كان يخاف شيئًا من الموانع كالمرض، فالسُّنَّة الاشتراط؛ لما ثبت عن النبي صلى الله عليه وسلّم أنه أمر ضباعة بنت الزبير بن عبد المطلب بذلك لما اشتكت إليه أنها مريضة[1].(الشيخ ابن باز -رحمه الله)'),
  Item(
      title: 'ما حكم استعمال المرأة لحبوب منع العادة الشهرية في أيام الحج؟',
      description:
          'لا حرج في ذلك؛ لأنَّ فيها فائدة ومصلحة، حتى تطوف مع الناس وحتى لا تعطل رفقتها.(الشيخ ابن باز -رحمه الله)'),
  Item(
      title:
          'ما حكم من حجَّ عن والدته، وعند الميقات لبَّى بالحج ولم يلب عن والدته؟',
      description:
          'ما دام الحج عن والدته ولكن نسي، فإن الحجَّ يكون لوالدته، والنية أقوى لقوله صلى الله عليه وسلم: "إنما الأعمال بالنيات"[2]. فإذا كان القصد من مجيئه هو الحجُّ عن أمِّه أو عن أبيه ثم نسي عند الإحرام، فإن الحج يكون للذي نواه وقصده من أب أو أم أو غيرهما.'),
  Item(
      title: 'هل يجوز تغيير لباس الإحرام لغسله؟',
      description:
          'لا بأس أن يغسل ملابس الإحرام، ولا بأس أن يغيرها ويستعمل غيرها بملابس جديدة أو مغسولة.(الشيخ ابن باز -رحمه الله)'),
  Item(
      title: 'هل يجوز للمرأة الحائض أن تجلس في المسعى؟',
      description:
          'نعم يجوز؛ لأن المسعى لا يعتبر من المسجد الحرام، ولذلك لو أن المرأة حاضت بعد الطواف وقبل السعي فإنّها تسعى؛ لأن السعي ليس طوافًا ولا تشترط له الطهارة.(الشيخ ابن عثيمين -رحمه الله)'),
  Item(
      title:
          'ما الحكم إذا أقيمت الصلاة والحاج أو المعتمر لم ينتهِ من إكمال الطواف أو السعي؟',
      description:
          'يصلي مع الناس، ثم يكمل طوافه وسعيه من حيث انتهى.(الشيخ ابن باز -رحمه الله)'),
  Item(
      title: 'هل يجوز للحاج أن يرمي من الحصى الذي حول الجمار؟',
      description:
          'يجوز له ذلك؛ لأنَّ الأصل أنه لم يحصل به الرمي، أما الذي في الحوض فلا يرمي بشيءٍ منه.(الشيخ ابن باز -حفظه الله)'),
  Item(
      title:
          'ما حكم من حجَّ وهو تاركٌ للصلاة، سواء كان عامدًا أو متهاونًا؟ وهل تجزئه عن حجّة الإسلام؟',
      description:
          'من حجَّ وهو تاركٌ للصلاة، فإن كان عن جحد لوجوبها كفر إجماعًا ولا يصحُّ حجّه، وأمّا إن كان تركها تساهلاً وتهاونًا فهذا فيه خلاف بين أهل العلم، منهم من يرى صحة حجِّه، ومنهم من لا يرى صحة حجِّه، والصواب أنه لا يصحُّ حجُّه أيضًا؛ لقول النبي صلّى الله عليه وسلّم: "العهد الذي بيننا وبينهم الصلاة، فمن تركها فقد كفر"[7]. وقوله صلى الله عليه وسلم: "إن بين الرجل وبين الشرك والكفر ترك الصلاة"[8]. وهذا يعمُّ من جحد وجوبها، ويعم من تركها تهاونًا.(الشيخ ابن باز-رحمه الله)'),
  Item(
      title: 'ما حكم من حصل عنده شك بأن بعض الحصى لم يسقط في الحوض؟',
      description:
          'من شكَّ فعليه التّكميل، يأخذ من الحصى الّذي عنده في منى من الأرض ويكمل بها.'),
  Item(
      title: 'هل يجوز أن يخيط الإحرام إذا تمزق أو يبدله؟',
      description:
          'له أن يخيطه وله أن يبدله بغيره، والأمر في ذلك واسع والحمد لله. والمخيط المنهيُّ عنه هو الّذي يحيط بالبدن كله كالقميص والفنيله وأشباه ذلك. أما المخيط الّذي يكون في الإزار أو في الرداء لكونه مكونًا من قطعتين أو أكثر خيط بعضها في بعض فلا حرج، وهكذا لو حصل به شقّ أو خرق فخاطه أو رقّعه، فلا بأس بذلك.(الشيخ ابن باز -رحمه الله)'),
];
